[
  {
    "id": 0,
    "description": "This is where it all began. This shit's nostalgic, yo."
  },
  {
    "id": 1,
    "description": "I love it when The Residents bring up \"newer\" stuff in pop culture. Like Pirates of the Carribean."
  },
  {
    "id": 2,
    "description": "Life is a lonely train wracked by Chicken God."
  },
  {
    "id": 3,
    "description": "Do you know how much I want a yarn Rz eyeball?! Well, I want one really badly."
  },
  {
    "id": 4,
    "description": "This is without a doubt my favorite episode of In My Room. And that's even before I realized that's '7 Cats'/'Rendering the Bacon' in the background."
  },
  {
    "id": 5,
    "description": "Hah! Looks like the Randyland directory DOES have some Bunny Boy in it."
  },
  {
    "id": 6,
    "description": "ENCORE! ENCORE!!!"
  },
  {
    "id": 7,
    "description": "man this guy is just going NUTS on Bunny Boy nostalgia. hm..."
  },
  {
    "id": 8,
    "description": "Dude! Pacific Rim was the closes we're getting to a live-action Neon Genesis Evangelion. Be thankful!"
  },
  {
    "id": 9,
    "description": "I watched the movie and I have no fucking clue what he's talking about."
  },
  {
    "id": 10,
    "description": "I thought it was a William Shatner head."
  },
  {
    "id": 11,
    "description": "I remember when I first watched this and was like \"WHAT? There's going to be an... alien abduction arc?\". But in the end Randyland was one of my favorite things the Residents have ever done. Anyway, hope you enjoyed looking at Randy's pubic hair."
  },
  {
    "id": 12,
    "description": "RandyとChico (...I, uh... I'm not explaining that joke). Anyway, I LOVE the foreshadowing in this episode when Randy mentions that Chico has a slight Mexican accent..."
  },
  {
    "id": 13,
    "description": "I love this kitchen."
  },
  {
    "id": 14,
    "description": "This episode is what really started getting me excited about Randyland... this episode actually tied it back to The Residents which for some reason is really powerful to me. I dig it. Also more foreshadowing with Chico's comments about the drummer leaving The Residents."
  },
  {
    "id": 15,
    "description": "This is the closest we're getting to a release of Sam's Enchanted Evening."
  },
  {
    "id": 16,
    "description": "I love how Randy really looks like an old man here."
  },
  {
    "id": 17,
    "description": "I have no clue if that Elvis Karate thing is true."
  },
  {
    "id": 18,
    "description": "I want to buy that sheep just for the novelty of owning a thing that was in Randyland but like... it's an inflatable sex toy so maybe I shouldn't buy it?"
  },
  {
    "id": 19,
    "description": "All the leaves are off of the oak and all the sheep have followed the spoken word"
  },
  {
    "id": 20,
    "description": "Schooner? I hardly know 'er!'"
  },
  {
    "id": 21,
    "description": "Dude, Randy. You haven't even seen 2017 yet. The stupid beam must have gotten turned up a notch."
  },
  {
    "id": 22,
    "description": "I really like Don's delivery here. He sounds like he's really trying to be a good friend of Randy's..."
  },
  {
    "id": 23,
    "description": "Jesus, I always get freaked out when I see windows without blinds at night. It's like... DUDE. People could be outside watching you and you can't even see it from the window glare!!!"
  },
  {
    "id": 24,
    "description": "I know this isn't actually an episode, but this actual segment isn't in the actual episode. And I really dig this and Randy's singing and dancing."
  },
  {
    "id": 25,
    "description": "Yeah, I couldn't make the \"skip Randyland opening\" function work on this episode because the opening is in the middle of the episode. ALSO: Is Randy's Driver a special guest as well or what?"
  },
  {
    "id": 26,
    "description": "Randy meets special guest Jim and plays his favorite song from the Shrek 2 Original Soundtrack."
  },
  {
    "id": 27,
    "description": "I fucking love this episode. It is just hilarious."
  },
  {
    "id": 28,
    "description": "I love the way Randy holds Maurice... it's so cute."
  },
  {
    "id": 29,
    "description": "Richard Nixon is like this long running joke with The Residents."
  },
  {
    "id": 30,
    "description": "ＳＨＯＷＥＲｂａＴＨ"
  },
  {
    "id": 31,
    "description": "That herpes joke kills me. Well, I assume it's a joke."
  },
  {
    "id": 32,
    "description": "I wonder if Schooner did that just to humor Randy or if he too believes that watch is high tech."
  },
  {
    "id": 33,
    "description": "This episode made me discover Maxine and it is the best walk-in music."
  },
  {
    "id": 34,
    "description": "It's not often I can go \"OH SHIT, I'VE BEEN THERE\" at a Randyland episode. Actually this is the only time I can do that."
  },
  {
    "id": 35,
    "description": "tfw chairy"
  },
  {
    "id": 36,
    "description": "I love how animated Randy is. Him pointing at that hole in the wall is just... everything, really."
  },
  {
    "id": 37,
    "description": "Why does everyone in Randy's universe have alliterative names?"
  },
  {
    "id": 38,
    "description": "Not the weirdest snapchat I got."
  },
  {
    "id": 39,
    "description": "Fuck Carlos."
  },
  {
    "id": 40,
    "description": "here's the god damn article by the way: https://www.vice.com/en_us/article/4w7gqj/the-ghost-rapes-of-bolivia-000300-v20n8"
  },
  {
    "id": 41,
    "description": "They were REALLY proud of that \"he's going to choke to death on a goddamn tortilla chip\" line."
  },
  {
    "id": 42,
    "description": ":("
  },
  {
    "id": 43,
    "description": "I'm going to be honest... I don't like this arc quite as much as the alien one, but it still has lots of laughs."
  },
  {
    "id": 44,
    "description": "Craigslist? Damn it Randy, you have to get with the times! Most people recruit for their militias on Tinder now!"
  },
  {
    "id": 45,
    "description": "Miss Tweedy? Dude. That breaks Residents canon man! It was Cheetah, Randy's eigth wife that painted it pink!"
  },
  {
    "id": 46,
    "description": "Some of those boxes in the background... hm..."
  },
  {
    "id": 47,
    "description": "Don, put down your camera and help them with the tent!"
  },
  {
    "id": 48,
    "description": "For some reason this reminds me of the Renaldo and the Loaf Gurdy Hurding video."
  },
  {
    "id": 49,
    "description": "Some more foreshadowing and hilarious moments with Schooner being vegetarian. Also I recognize a Garageband sample in here."
  },
  {
    "id": 50,
    "description": "Now that I think about it, Schooner seems really nice. How did he fuck up taking care of Maurice so badly during the WoW show?"
  },
  {
    "id": 51,
    "description": "I want to eat Chinese food with Randy."
  },
  {
    "id": 52,
    "description": "I'm going to guess Census Taker is one of Randy's favorite projects, pushing it twice in the series."
  },
  {
    "id": 53,
    "description": "There are a lot of really constructive comments on this video in particular. I wonder if its because there was subtle foreshadowing throughout this whole arc that made people feel like it was just some fake story the whole time. Or maybe they're all Cliffords I dunno."
  },
  {
    "id": 54,
    "description": "I'd love to see them film those outdoor scenes."
  },
  {
    "id": 55,
    "description": "tfw your friends find out your a furry. Also such a heartwarming ending..."
  },
  {
    "id": 56,
    "description": "stretches and stretches and stretches and stretches and stretches and stretches and stretches"
  },
  {
    "id": 57,
    "description": "You sure you're not going to Tokyo? You already have the face mask!"
  },
  {
    "id": 58,
    "description": "The Ghost of Hope?! Everyone, including Randy, knows it's called A Train Wracked by God!"
  },
  {
    "id": 59,
    "description": "They must be wering some kind of plgue doctor msks."
  },
  {
    "id": 60,
    "description": "Dang, that's exactly what The Residents are saying! You hit the nail on the head, Randy!"
  },
  {
    "id": 61,
    "description": "R.I.P. Randy Rose. I'm buying your ashes on e-bay."
  }
]
